# 画出内存图
import copy

list01 = [
    ["烤鸭", "豆汁"],
    ["火锅", "兔头"],
    ["麻花", "包子"],
]
list02 = list01
list03 = list01[:]
list04 = copy.deepcopy(list01)

list04[0] = ["全聚德", "大董"]  # 深拷贝互不影响，浅拷贝第一层互不影响，但是第二层开始影响
print(list04)  # [['全聚德', '大董'], ['火锅', '兔头'], ['麻花', '包子']]
print(list01)  # [['烤鸭', '豆汁'], ['火锅', '兔头'], ['麻花', '包子']]

list03[0][1] = ["全聚德", "大董"]  # 浅拷贝 第一层互不影响，但是第二层开始影响
print(list03)  # [['烤鸭', ['全聚德', '大董']], ['火锅', '兔头'], ['麻花', '包子']]
print(list01)  # [['烤鸭', ['全聚德', '大董']], ['火锅', '兔头'], ['麻花', '包子']]

list02[0][:] = ["全聚德", "大董"]  # 这边的切片并没有产生新的列表，这里的意思只是说右边的赋值给左边那一片
print(list02)  # [['全聚德', '大董'], ['火锅', '兔头'], ['麻花', '包子']]
print(list01)  # [['全聚德', '大董'], ['火锅', '兔头'], ['麻花', '包子']]
